<template>
  <v-card-text>
    <div class="my-3">
      <p>
        1. พี่กระต่ายเป็นเศรษฐีรวยระดับพันล้าน
        วันหนึ่งนึกสนุกจึงได้มอบภารกิจให้พี่เจตซึ่งเป็นลูกน้อง
        โดยให้ทำการหาว่าโทรศัพท์ของพี่กระต่ายจะพังเมื่อตกจากตึกชั้นที่ต่ำสุดชั้นใดจากตึกที่มี
        1,000 ชั้น!!! โดยพี่กระต่ายมีโทรศัพท์ให้ใช้ทดลอง Drop test
        ครั้งนี้อยู่ทั้งหมด 10 เครื่อง
        <u>น้องๆจะช่วยพี่เจตหาคำตอบของภารกิจนี้ได้อย่างไร</u>
      </p>
    </div>
    <v-textarea
      v-model="form.item1"
      class="nolabel"
      rows="8"
      box
      single-line
      :readonly="readonly"
      :disabled="disable && !readonly"
    />
    <div class="my-3">
      <p>
        2. ในงานเลี้ยงปีใหม่ของรุ่นพี่สตาฟ CE Smart Camp ครั้งที่12
        มีการจับฉลากกันเพื่อลุ้นรางวัล โดย MC ได้บอกกับผู้ร่วมงานว่า
        ถุงที่เราจะใช้จับรางวัลกันในค่ำคืนแห่งความสุขนี้
        จะมีคูปองที่ไม่ใช่มูลค่า 10บาทสองใบ มีคูปองที่ไม่ใช่มูลค่า 100บาทสองใบ
        และมีคูปองที่ไม่ใช่มูลค่า 1000บาทสองใบ
        พี่ๆสตาฟที่เข้าร่วมงานจึงอยากรู้ว่า
        <u
          >ถุงที่ใช้จับรางวัลนั้นมีคูปองอยู่กี่ใบ
          จึงอยากให้น้องๆช่วยพี่ๆคิดพร้อมแสดงวิธีการหาคำตอบให้พี่ๆหน่อย</u
        >
      </p>
    </div>
    <v-textarea
      v-model="form.item2"
      class="nolabel"
      rows="8"
      box
      single-line
      :readonly="readonly"
      :disabled="disable && !readonly"
    />
    <div class="my-3">
      <p>
        3. สมบัติ มีเพื่อนคือ สมชายและสมหญิง ที่สนิทกันมาตั้งแต่สมัยเด็กๆ
        แต่ทั้งสมชายและสมหญิง ต่างไม่รู้วันเกิดของสมบัติ
        วันหนึ่งสมชายจึงไปหาสมบัติเพื่อถามวันเกิด แต่สมบัติไม่บอกทั้งหมด
        โดยให้สมชายเลือกที่จะรู้วันหรือเดือนอย่างใดอย่างหนึ่ง
        สมบัติจึงเลือกเดือน และได้เรียกสมหญิงให้มาถามวันเกิด
        แต่สมบัติก็ไม่บอกทั้งหมดเช่นเดียวกับสมชาย
        โดยให้เลือกเอาอย่างใดอย่างหนึ่ง สมหญิงจึงเลือกวัน
        แต่ก่อนที่สมบัติจะบอกคำตอบแก่ทั้งสอง
        สมบัติได้ให้ตัวเลือกวันเกิดมาทั้งหมดสิบข้อ
        <br /><br />
        2 มกราคม / 3 มกราคม / 6 มกราคม / 4 กุมภาพันธ์ / 5 กุมภาพันธ์ / 1 มีนาคม
        / 3 มีนาคม / 1 เมษายน / 2 เมษายน / 4 เมษายน
        <br /><br />
        จากนั้นสมบัติจึงบอกวันแก่สมหญิง และเดือนแก่สมชาย เสร็จแล้วทั้งสมชาย
        และสมหญิงเริ่มจึงคุยกัน
        <br /><br />
        สมชาย : เราไม่รู้ว่าวันเกิดของสมบัติอะ
        แต่เรารู้ว่าสมหญิงก็ไม่รู้เหมือนกัน<br />
        สมหญิง : ตอนแรกก็ไม่รู้นะว่าวันเกิดของสมบัติคือวันไหน แต่ตอนนี้รู้ละ<br />
        สมชาย : อ่าวหรอ งั้นตอนนี้เราก็รู้ละว่าวันเกิดสมบัติคือวันอะไร<br />
        <br />
        <u>จงหาวันเกิดของสมบัติพร้อมแสดงวิธีการหา</u>
      </p>
    </div>
    <v-textarea
      v-model="form.item3"
      class="nolabel"
      rows="8"
      box
      single-line
      :readonly="readonly"
      :disabled="disable && !readonly"
    />
  </v-card-text>
</template>

<script>
export default {
  props: {
    value: {
      type: Object,
      default: function() {
        return {};
      }
    },
    readonly: {
      type: Boolean,
      default: false
    },
    disable: {
      type: Boolean,
      default: false
    }
  },
  data: () => ({
    form: {
      item1: null,
      item2: null,
      item3: null
    }
  }),
  watch: {
    form: {
      handler(val) {
        this.$emit("input", val);
      },
      deep: true
    },
    value: {
      handler(val) {
        this.form = val;
      },
      deep: true
    }
  },
  mounted: function() {
    if (this.value !== null) {
      Object.keys(this.form).forEach(key => {
        this.form[key] = this.value[key] || null;
      });
    }
    this.$emit("input", this.form);
  }
};
</script>
